#header გამოიყენება გვერდის ან სექციის სათაურის ჩასაწერად. მაგალითად, ლოგო, ნავიგაციის მენიუ ან გვერდის მთავარი სათაური.

#main ძირითადი შინაარსისთვის გამოიყენება. ყველაფერი, რაც გვერდის მთავარ თემას ეხება, აქ უნდა მოთავსდეს

#footer გვერდის ან სექციის ქვედა ნაწილია. აქ ხშირად იწერება copyright, საკონტაქტო ინფორმაცია ან დამატებითი ლინკები.

#arcticle დამოუკიდებელი, დასრულებული შინაარსის ბლოკი. მაგალითად, ბლოგ-პოსტი, სიახლე, ფორუმის პოსტი რისი წაკითხვაც ცალკეც შეიძლება

#section გვერდის შინაარსის თემატური დაყოფისთვის გამოიყენება. ცალკე ნაწილების ჯგუფებად ორგანიზებისთვის.