    #inline css

#სტილი ეწერება პირდაპირ HTML ელემენტზე style ატრიბუტით.კარგი კონკრეტული, ერთჯერადი ცვლილებისთვის.
#არაეფექტურია დიდი პროექტებისთვის, არღვევს კოდის სისუფთავეს.


    #inetrnal css

#სტილები ჩაწერილია HTML ფაილის <head> ნაწილში <style> ბლოკში. გამოდგება ერთგვერდიანი ვებსაიტებისთვის.
#არ მუშაობს მრავალგვერდიან პროექტებზე — სტილები არ იძლევა ხელახალ გამოყენებას.


    #external css
#სტილები ინახება ცალკე .css ფაილში და HTML-თან ერთდება link თეგით. საუკეთესო ვარიანტია ორგანიზებულ, მრავალგვერდიან ვებსაიტებზე.
#საჭიროებს დამატებით ფაილს, თუმცა გამარტივებს კოდის მართვას.


