#Flexbox არის CSS-ის მოდელი, რომელიც ამარტივებს ელემენტების მოქნილ განლაგებას ერთ რიგში ან სვეტში
#flex-direction: განსაზღვრავს ელემენტების განლაგების მიმართულებას row, column, და მათი უკუქცევები


#justify-content: განაწილებს ელემენტებს მთავარ ღერძზე; მნიშვნელობები:

#space-between: ელემენტები თანაბრად გადანაწილებული, პირველი და ბოლო კიდეებზე.
#space-around: ელემენტებს თავიანთი ორივე მხარეს სივრცე აქვთ, კიდეებთან ნახევარი სივრცე.
#space-evenly: ყველგან თანაბარი სივრცე, კიდეებთანაც.


#align-items: განლაგებს ელემენტებს გადამკვეთ ღერძზე (ზევით, ქვემოთ, ცენტრში ან იწელება).

#flex-wrap: მართავს გადატანას ახალ ხაზზე თუ სივრცე არ ეყოფა.
#flex-grow: რამდენად იზრდება ელემენტი დამატებით სივრცეზე.
#flex-shrink: რამდენად იკუმშება ელემენტი სივრცის უკმარისობისას.


#Main Axis: მთავარი ღერძი, რომელზეც ელემენტები ილაგებიან (დადგენილი flex-direction-ით).
#Cross Axis: ამ ღერძის გადამკვეთი (პერპენდიკულარული) ღერძი.

