
#CSS rule ეს არის მთელი წესი, რომელიც განსაზღვრავს როგორ უნდა გამოიყურებოდეს HTML ელემენტი.
    # იგი შედგება სელექტორისა და დეკლარაციის ბლოკისგან.

#selector სელექტორი არის CSS-ის ის ნაწილი, რომელიც მიუთითებს რომელ HTML ელემენტზე უნდა გავრცელდეს მოცემული სტილი. 

#declaration დეკლარაცია არის CSS წესი, რომელიც აღწერს კონკრეტულ სტილს, რასაც ელემენტს ვანიჭებთ. 
    #ის ყოველთვის შედგება ორი ნაწილისგან: property და value 

#Property არის სტილის სახელი მას ვცვლით ელემენტში. თითოეული property განსაზღვრავს კონკრეტულ სტილურ ასპექტს, 
    #მაგალითად: ფერს, ზომას, შრიფტს, ზღვარს, სივრცეს

#Value არის ის კონკრეტული მნიშვნელობა, რომელსაც ვანიჭებთ Property-ს. სწორედ value-ის საშუალებით ხდება სტილის განსაზღვრა კონკრეტულად 